/*
 * Copyright 2015-2021 the original author or authors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

package com.github.math.number;

import java.io.Serializable;

/**
 * <p>
 * 实数，是有理数和无理数的总称。数学上，实数定义为与数轴上的点相对应的数。实数可以直观地看作有限小数与
 * 无限小数，实数和数轴上的点一一对应。但仅仅以列举的方式不能描述实数的整体。实数和虚数共同构成复数。
 * <p>
 * 实数可以分为有理数和无理数两类，或代数数和超越数两类。实数集通常用黑正体字母 R 表示。R表示n维实数空
 * 间。实数是不可数的。实数是实数理论的核心研究对象。
 * <p>
 * 所有实数的集合则可称为实数系（real number system）或实数连续统。任何一个完备的阿基米德有序域
 * 均可称为实数系。在保序同构意义下它是惟一的，常用R表示。由于R是定义了算数运算的运算系统，故有实数系这
 * 个名称。
 * <p>
 * 实数可以用来测量连续的量。理论上，任何实数都可以用无限小数的方式表示，小数点的右边是一个无穷的数列（可
 * 以是循环的，也可以是非循环的）。在实际运用中，实数经常被近似成一个有限小数（保留小数点后n位，n为正整
 * 数）。在计算机领域，由于计算机只能存储有限的小数位数，实数经常用浮点数来表示。
 * 
 * <h1>基本运算</h1>
 * <p>
 * 实数可实现的基本运算有加、减、乘、除、乘方等，对非负数（即正数和0）还可以进行开方运算。实数加、减、乘、
 * 除（除数不为零）、平方后结果还是实数。任何实数都可以开奇次方，结果仍是实数，只有非负实数，才能开偶次方其
 * 结果还是实数。
 * 
 * <h1>性质</h1>
 * 
 * <p>
 * <h2>封闭性</h2>
 * <p>
 * 实数集对加、减、乘、除（除数不为零）四则运算具有封闭性，即任意两个实数的和、差、积、商（除数不为零）仍然
 * 是实数。
 * <h2>有序性</h2>
 * <p>
 * 实数集是有序的，即任意两个实数 a，b、 必定满足并且只满足下列三个关系之一： 
 * <h2>传递性</h2>
 * <p>
 * 实数大小具有传递性，即若 ，且 ，则有 。
 * <h2>阿基米德性质</h2>
 * <p>
 * 实数具有阿基米德性质（Archimedean property），即 ， ，若 ，则∃正整数 ， 。
 * <h2>稠密性</h2>
 * <p>
 * 实数集具有稠密性，即两个不相等的实数之间必有另一个实数，既有有理数，也有无理数.
 * <h2>完备性</h2>
 * <p>
 * 作为度量空间或一致空间，实数集合是个完备空间，它有以下性质：
 * <p>
 * 一. 所有实数的柯西序列都有一个实数极限。有理数集合就不是完备空间。例如，(1, 1.4, 1.41, 1.414,
 * 1.4142, 1.41421, ...) 是有理数的柯西序列，但没有有理数极限。实际上，它有个实数极限 。实数是有
 * 理数的完备化——这亦是构造实数集合的一种方法。 极限的存在是微积分的基础。实数的完备性等价于欧几里德几何的
 * 直线没有“空隙”。 
 * <p>
 * 二.“完备的有序域” 实数集合通常被描述为“完备的有序域”，这可以几种解释。首先，有序域可以是完备格。然而，
 * 很容易发现没有有序域会是完备格。这是由于有序域没有最大元素（对任意元素 ，将更大）。所以，这里的“完备”不
 * 是完备格的意思。另外，有序域满足戴德金完备性，这在上述公理中已经定义。上述的唯一性也说明了这里的“完备”
 * 是指戴德金完备性的意思。这个完备性的意思非常接近采用戴德金分割来构造实数的方法，即从（有理数）有序域出发，
 * 通过标准的方法建立戴德金完备性。这两个完备性的概念都忽略了域的结构。然而，有序群（域是种特殊的群）可以定
 * 义一致空间，而一致空间又有完备空间的概念。上述完备性中所述的只是一个特例。（这里采用一致空间中的完备性概念，
 * 而不是相关的人们熟知的度量空间的完备性，这是由于度量空间的定义依赖于实数的性质。）当然，并不是唯一的一致
 * 完备的有序域，但它是唯一的一致完备的阿基米德域。实际上，“完备的阿基米德域”比“完备的有序域”更常见。可以证明，
 * 任意一致完备的阿基米德域必然是戴德金完备的（当然反之亦然）。这个完备性的意思非常接近采用柯西序列来构造实数
 * 的方法，即从（有理数）阿基米德域出发，通过标准的方法建立一致完备性。“完备的阿基米德域”最早是由希尔伯特提
 * 出来的，他还想表达一些不同于上述的意思。他认为，实数构成了最大的阿基米德域，即所有其他的阿基米德域都是 的子域。
 * 这样是“完备的”是指，在其中加入任何元素都将使它不再是阿基米德域。这个完备性的意思非常接近用超实数来构造实数的方法，
 * 即从某个包含所有（超实数）有序域的纯类出发，从其子域中找出最大的阿基米德域。
 * <h2>与数轴对应</h2>
 * <p>
 * 如果在一条直线（通常为水平直线）上确定作为原点，指定一个方向为正方向（通常把指向右的方向规定为正方向），
 * 并规定一个单位长度，则称此直线为数轴。任一实数都对应与数轴上的唯一一个点；反之，数轴上的每一个点也都唯一的
 * 表示一个实数。于是，实数集与数轴上的点有着一一对应的关系。
 * <h2>高级性质</h2>
 * <p>
 * 实数集是不可数的，也就是说，实数的个数严格多于自然数的个数（尽管两者都是无穷大）。这一点，可以通过康托尔对
 * 角线方法证明。实际上，实数集的势为（请参见连续统的势），即自然数集的幂集的势。由于实数集中只有可数集个数的
 * 元素可能是代数数，绝大多数实数是超越数。实数集的子集中，不存在其势严格大于自然数集的势且严格小于实数集的势
 * 的集合，这就是连续统假设。事实上这假设独立于ZFC集合论，在ZFC集合论内既不能证明它，也不能推出其否定。所有
 * 非负实数的平方根属于R，但这对负数不成立。这表明R上的序是由其代数结构确定的。而且，所有奇数次多项式至少有一
 * 个根属于R。这两个性质使成为实封闭域的最主要的实例。证明这一点就是对代数基本定理的证明的前半部分。实数集拥
 * 有一个规范的测度，即勒贝格测度。 实数集的上确界公理用到了实数集的子集，这是一种二阶逻辑的陈述。不可能只采
 * 用一阶逻辑来刻画实数集： 
 * <ol>
 * <li>Löwenheim–Skolem theorem定理说明，存在一个实数集的可数稠密子集，它在一阶逻辑中正好满足和实
 * 数集自身完全相同的命题；
 * <li>超实数的集合远远大于R，但也同样满足和R一样的一阶逻辑命题。满足和R一样的一阶逻辑命题的有序域称为R的非
 * 标准模型。这就是非标准分析的研究内容，在非标准模型中证明一阶逻辑命题（可能比在中证明要简单一些），从而确
 * 定这些命题在R中也成立。
 * </ol>
 * <h2>拓扑性质</h2>
 * <p>
 * 实数集构成一个度量空间： x和 y间的距离定为绝对值 。作为一个全序集，它也具有序拓扑。这里，从度量和序关系得到
 * 的拓扑相同。实数集又是 1维的可缩空间（所以也是连通空间）、局部紧致空间、可分空间、贝利空间。但实数集不是紧
 * 致空间。这些可以通过特定的性质来确定，例如，无限连续可分的序拓扑必须和实数集同胚。以下是实数的拓扑性质总览：
 * <ol>
 * <li>令a为一实数。 a的邻域是实数集中一个包括一段含有a的线段的子集。 
 * <li>R是可分空间。 
 * <li>Q 在R中处处稠密。 
 * <li>R的开集是开区间的联集。
 * <li>R的紧子集是有界闭集。特别是：所有含端点的有限线段都是紧子集。 
 * <li>每个R中的有界序列都有收敛子序列。 
 * <li>R是连通且单连通的。
 * <li>R中的连通子集是线段、射线与R本身。由此性质可迅速导出中间值定理。
 * </ol>
 * 
 * <h1>发展历史</h1>
 * <p>
 * 在公元前500年左右，以毕达哥拉斯为首的希腊数学家们认识到有理数在几何上不能满足需要，但毕达哥拉斯本身并不
 * 承认无理数的存在。直到17世纪，实数才在欧洲被广泛接受。18世纪，微积分学在实数的基础上发展起来。1871年，
 * 德国数学家康托尔第一次提出了实数的严格定义。
 * <p>
 * 根据日常经验，有理数集在数轴上似乎是“稠密”的，于是古人一直认为用有理数即能满足测量上的实际需要。以边长为
 * 1厘米的正方形为例，其对角线有多长？在规定的精度下（比如误差小于0.001厘米），总可以用有理数来表示足够精
 * 确的测量结果（比如1.414厘米）。但是，古希腊毕达哥拉斯学派的数学家发现，只使用有理数无法完全精确地表示这
 * 条对角线的长度，这彻底地打击了他们的数学理念；他们原以为：
 * <p>
 * 任何两条线段（的长度）的比，可以用自然数的比来表示。
 * <p>
 * 正因如此，毕达哥拉斯本人甚至有“万物皆数”的信念，这里的数是指自然数（1 , 2 , 3,...），而由自然数的
 * 比就得到所有正有理数，而有理数集存在“缝隙”这一事实，对当时很多数学家来说可谓极大的打击(见第一次数学危机)。
 * <p>
 * 从古希腊一直到17世纪，数学家们才慢慢接受无理数的存在，并把它和有理数平等地看作数；后来有虚数概念的引入，
 * 为加以区别而称作“实数”，意即“实在的数”。在当时，尽管虚数已经出现并广为使用，实数的严格定义却仍然是个难
 * 题，以至函数、极限和收敛性的概念都被定义清楚之后，才由十九世纪末的戴德金、康托等人对实数进行了严格处理。
 * <p>
 * <strong>以上内容摘自百度百科<strong>
 * 
 * @author    王帅
 * @since     1.0
 * @param <T> 数字的类型
 */
public abstract class RealNumber<T> extends Number 
	implements Arithmetic<T>, Comparable<T>, Signum, Cloneable, Serializable {
	// The serialVersionUID of the class RealNumber.
	private static final long serialVersionUID = -4370856310245529152L;
	
	// 为java.lang.Number类中的方法添加中文注释。

	/**
	 * 以{@code byte}形式返回指定的数值。这可能会涉及到舍入或取整。 
	 * 
	 * @return 转换为{@code byte}类型后该对象表示的数值。
	 */
	@Override
	public byte byteValue() {
		return (byte) intValue();
	}

	/**
	 * 以{@code short}形式返回指定的数值。这可能会涉及到舍入或取整。 
	 * 
	 * @return 转换为{@code short}类型后该对象表示的数值。
	 */
	@Override
	public short shortValue() {
		return (short) intValue();
	}

	/**
	 * 以{@code int}形式返回指定的数值。这可能会涉及到舍入或取整。 
	 * 
	 * @return 转换为{@code int}类型后该对象表示的数值。
	 */
	@Override
	public abstract int intValue();

	/**
	 * 以{@code long}形式返回指定的数值。这可能会涉及到舍入或取整。
	 * 
	 * @return 转换为{@code long}类型后该对象表示的数值。
	 */
	@Override
	public abstract long longValue();

	/**
	 * 以{@code float}形式返回指定的数值。这可能会涉及到舍入。
	 * 
	 * @return 转换为{@code float}类型后该对象表示的数值。
	 */
	@Override
	public abstract float floatValue();

	/**
	 * 以{@code double}形式返回指定的数值。这可能会涉及到舍入。
	 * 
	 * @return 转换为{@code double}类型后该对象表示的数值。
	 */
	@Override
	public abstract double doubleValue();
	
	// 重写java.lang.Object中的必要方法。

	/**
	 * 创建并返回此对象的一个副本。
	 * 
	 * @return 此实例的一个副本。 
	 */
	@Override
	public T clone() {
		try {
			@SuppressWarnings("unchecked")
			T ret = (T) super.clone();
			return ret;
		} catch (CloneNotSupportedException e) {
			return null;
		}
	}
	
	/**
	 * 返回该对象的哈希码值。
	 * 
	 * @return 此对象的一个哈希码值。
	 */
	@Override
	public abstract int hashCode();

	/**
	 * 判断两个实数的值是否相等。
	 * 
	 * @param obj 与之比较的对象。
	 * @return 如果此对象与参数{@code obj}在数值上相同，则返
	 *         回{@code true}，否则返回{@code false}。
	 */
	@Override
	public abstract boolean equals(Object obj);
	
	/**
	 * 返回该实数对象的字符串表示。
	 * 
	 * @return 该实数对象的字符串表示形式。
	 */
	@Override
	public abstract String toString();
	
	/**
	 * 返回一个带括号的结果表示形式。
	 * 
	 * @return 含括号的字符序列
	 */
	public String toParenthesisString() {
		return "(" + toString() + ")";
	}

	// 为java.lang.Comparable接口的指定方法添加注释。

	/**
	 * 比较此对象与指定对象的顺序。如果该对象小于、等于或大于指定对象，则分别返回负整数、零或正整数。
	 * 
	 * @param o 要比较的对象。 
	 * @return 负整数、零或正整数，根据此对象是小于、等于还是大于指定对象。 
	 */
	@Override
	public abstract int compareTo(T o);

}
